package com.dzc.work;


import java.io.*;
import java.util.HashSet;
import java.util.Set;

public class Test {


    static String function = "功能号\t809023\n" +
            "功能号\t809024\n" +
            "功能号\t809027\n" +
            "功能号\t809120\n" +
            "功能号\t809021\n" +
            "功能号\t809022\n" +
            "功能号\t809030\n" +
            "功能号\t809013\n" +
            "功能号\t809016\n" +
            "功能号\t809215\n" +
            "功能号\t809214\n" +
            "功能号\t809216\n" +
            "功能号\t809217\n" +
            "功能号\t809031\n" +
            "功能号\t809121\n" +
            "功能号\t331200\n" +
            "功能号\t809000\n" +
            "功能号\t809020\n" +
            "功能号\t809102\n" +
            "功能号\t809119\n" +
            "功能号\t809200\n" +
            "功能号\t809201\n" +
            "功能号\t809205\n" +
            "功能号\t331133\n" +
            "功能号\t330010\n" +
            "功能号\t809300\n" +
            "功能号\t809123\n" +
            "功能号\t809124\n" +
            "功能号\t809125\n" +
            "功能号\t809406\n" +
            "功能号\t809314\n" +
            "功能号\t809315\n" +
            "功能号\t333104\n" +
            "功能号\t330312\n" +
            "功能号\t332850\n" +
            "功能号\t332854\n" +
            "功能号\t339655\n" +
            "功能号\t332857\n" +
            "功能号\t332855\n" +
            "功能号\t332862\n" +
            "功能号\t332868\n" +
            "功能号\t332869\n" +
            "功能号\t332870\n" +
            "功能号\t332892\n" +
            "功能号\t809122\n" +
            "功能号\t322000\n" +
            "功能号\t332852\n" +
            "功能号\t332872\n" +
            "功能号\t400\n" +
            "功能号\t333000\n" +
            "功能号\t809108\n" +
            "功能号\t809203\n" +
            "功能号\t809211\n" +
            "功能号\t331101\n" +
            "功能号\t809101\n" +
            "功能号\t809103\n" +
            "功能号\t809209\n" +
            "功能号\t809210\n" +
            "功能号\t809025\n" +
            "功能号\t809026\n" +
            "功能号\t809316\n" +
            "功能号\t809317\n" +
            "功能号\t809318\n" +
            "功能号\t809319\n" +
            "功能号\t809320\n" +
            "功能号\t809321\n" +
            "功能号\t809324\n" +
            "功能号\t809327\n" +
            "功能号\t809301\n" +
            "功能号\t809322\n" +
            "功能号\t809126\n" +
            "功能号\t809323\n" +
            "功能号\t809032\n" +
            "功能号\t809107\n" +
            "功能号\t809036\n" +
            "功能号\t809331\n" +
            "功能号\t809332\n" +
            "功能号\t809333\n" +
            "功能号\t809334\n" +
            "功能号\t809306\n" +
            "功能号\t809520\n" +
            "功能号\t809517\n" +
            "功能号\t809500\n" +
            "功能号\t809003\n" +
            "功能号\t332217\n" +
            "功能号\t332255\n" +
            "功能号\t809104\n" +
            "功能号\t809603\n" +
            "功能号\t809604\n" +
            "功能号\t331157\n" +
            "功能号\t331103\n" +
            "功能号\t809007\n" +
            "功能号\t332893\n" +
            "功能号\t809800\n" +
            "功能号\t809801\n" +
            "功能号\t809802\n" +
            "功能号\t331210\n" +
            "功能号\t331018\n" +
            "功能号\t331211\n" +
            "功能号\t809130\n" +
            "功能号\t809344\n" +
            "功能号\t809345\n" +
            "功能号\t809220\n" +
            "功能号\t330002\n" +
            "功能号\t809347\n" +
            "功能号\t809040\n" +
            "功能号\t809218\n" +
            "功能号\t809219\n" +
            "功能号\t809223\n" +
            "功能号\t809224\n" +
            "功能号\t809129\n" +
            "功能号\t809043\n" +
            "功能号\t809225\n" +
            "功能号\t809017\n" +
            "功能号\t809042\n" +
            "功能号\t809337\n" +
            "功能号\t809338\n" +
            "功能号\t809229\n" +
            "功能号\t809230\n" +
            "功能号\t809231\n" +
            "功能号\t809232\n" +
            "功能号\t809233\n" +
            "功能号\t809354\n" +
            "功能号\t809355\n" +
            "功能号\t337608\n" +
            "功能号\t809351\n" +
            "功能号\t330300\n" +
            "功能号\t337150\n" +
            "功能号\t337350\n" +
            "功能号\t337450\n" +
            "功能号\t809349\n" +
            "功能号\t809350\n" +
            "功能号\t331476\n" +
            "功能号\t331483\n" +
            "功能号\t331484\n" +
            "功能号\t330003\n" +
            "功能号\t809132\n" +
            "功能号\t809226\n" +
            "功能号\t809227\n" +
            "功能号\t809352\n" +
            "功能号\t809353\n" +
            "功能号\t809228\n" +
            "功能号\t809044\n" +
            "功能号\t809045\n" +
            "功能号\t809080\n" +
            "功能号\t809039\n" +
            "功能号\t809359\n" +
            "功能号\t809001\n" +
            "功能号\t809360\n" +
            "功能号\t809236\n" +
            "功能号\t809610\n" +
            "功能号\t809611\n" +
            "功能号\t809609\n" +
            "功能号\t809612\n" +
            "功能号\t331158\n" +
            "功能号\t809367\n" +
            "功能号\t809368\n" +
            "功能号\t331011\n" +
            "功能号\t331618\n" +
            "功能号\t331520\n" +
            "功能号\t330004\n" +
            "功能号\t809707\n" +
            "功能号\t809706\n" +
            "功能号\t809066\n" +
            "功能号\t809047\n" +
            "功能号\t809408\n" +
            "功能号\t809035\n" +
            "功能号\t809339\n" +
            "功能号\t331013\n" +
            "功能号\t809521\n" +
            "功能号\t331523\n" +
            "功能号\t331524\n" +
            "功能号\t809832\n" +
            "功能号\t331389\n" +
            "功能号\t332252\n" +
            "功能号\t809409\n" +
            "功能号\t331531\n" +
            "功能号\t809833\n" +
            "功能号\t809070\n" +
            "功能号\t809048\n" +
            "功能号\t110200\n" +
            "功能号\t809311\n" +
            "功能号\t809073\n" +
            "功能号\t809074\n" +
            "功能号\t809075\n" +
            "功能号\t809839\n" +
            "功能号\t809837\n" +
            "功能号\t809841\n" +
            "功能号\t809843\n" +
            "功能号\t809066\n" +
            "功能号\t809047\n" +
            "功能号\t809408\n" +
            "功能号\t809035\n" +
            "功能号\t809339\n" +
            "功能号\t331013\n" +
            "功能号\t809521\n" +
            "功能号\t331523\n" +
            "功能号\t331524\n" +
            "功能号\t809832\n" +
            "功能号\t331389\n" +
            "功能号\t332252\n" +
            "功能号\t809409\n" +
            "功能号\t331531\n" +
            "功能号\t809833\n" +
            "功能号\t809070\n" +
            "功能号\t809048\n" +
            "功能号\t110200\n" +
            "功能号\t809311\n" +
            "功能号\t809073\n" +
            "功能号\t809074\n" +
            "功能号\t809075\n" +
            "功能号\t809839\n" +
            "功能号\t809837\n" +
            "功能号\t809841\n" +
            "功能号\t809843\n";


    static String function2 = "809203\n" +
            "809211\n" +
            "809204\n" +
            "809205\n" +
            "809217\n" +
            "809200\n" +
            "809201\n" +
            "809209\n" +
            "809210\n" +
            "809212\n" +
            "809213\n" +
            "809214\n" +
            "809216\n" +
            "809215\n" +
            "809218\n" +
            "809219\n" +
            "809220\n" +
            "809221\n" +
            "809222\n" +
            "809223\n" +
            "809224\n" +
            "809225\n" +
            "809226\n" +
            "809227\n" +
            "809228\n" +
            "809229\n" +
            "809230\n" +
            "809231\n" +
            "809354\n" +
            "809355\n" +
            "809232\n" +
            "809233\n" +
            "809234\n" +
            "809235\n" +
            "809236\n" +
            "809237\n" +
            "809064\n" +
            "809029\n" +
            "809038\n" +
            "809013\n" +
            "809014\n" +
            "809015\n" +
            "809016\n" +
            "809017\n" +
            "809020\n" +
            "809030\n" +
            "809031\n" +
            "809032\n" +
            "809033\n" +
            "809034\n" +
            "809035\n" +
            "809036\n" +
            "809039\n" +
            "809041\n" +
            "809042\n" +
            "809043\n" +
            "809044\n" +
            "809045\n" +
            "809046\n" +
            "809047\n" +
            "809049\n" +
            "809056\n" +
            "809066\n" +
            "809067\n" +
            "809072\n" +
            "809073\n" +
            "809074\n" +
            "809075\n" +
            "809076\n" +
            "809077\n" +
            "809079\n" +
            "809099\n" +
            "809025\n" +
            "809026\n" +
            "809050\n" +
            "809051\n" +
            "809059\n" +
            "809060\n" +
            "809061\n" +
            "809052\n" +
            "809053\n" +
            "809054\n" +
            "809065\n" +
            "809055\n" +
            "809057\n" +
            "809058\n" +
            "809062\n" +
            "809068\n" +
            "809069\n" +
            "809071\n" +
            "809021\n" +
            "809022\n" +
            "809063\n" +
            "809018\n" +
            "809081\n" +
            "809082\n" +
            "809083\n" +
            "809084\n" +
            "809085\n" +
            "809086\n" +
            "809087\n" +
            "809088\n" +
            "809089\n" +
            "809090\n" +
            "809091\n" +
            "809092\n" +
            "809023\n" +
            "809024\n" +
            "809027\n" +
            "809037\n" +
            "809040\n" +
            "809048\n" +
            "809070\n" +
            "809078\n" +
            "809602\n" +
            "809603\n" +
            "809604\n" +
            "809605\n" +
            "809606\n" +
            "809607\n" +
            "809608\n" +
            "809609\n" +
            "809610\n" +
            "809611\n" +
            "809612\n" +
            "809107\n" +
            "809101\n" +
            "809102\n" +
            "809103\n" +
            "809104\n" +
            "809105\n" +
            "809119\n" +
            "809108\n" +
            "809301\n" +
            "809347\n" +
            "809120\n" +
            "809121\n" +
            "809122\n" +
            "809126\n" +
            "809127\n" +
            "809128\n" +
            "809129\n" +
            "809130\n" +
            "809131\n" +
            "809132\n" +
            "809133\n" +
            "809134\n" +
            "809123\n" +
            "809124\n" +
            "809406\n" +
            "809404\n" +
            "809405\n" +
            "809407\n" +
            "809408\n" +
            "809409\n" +
            "809410\n" +
            "809400\n" +
            "809411\n" +
            "809412\n" +
            "809413\n" +
            "809450\n" +
            "809800\n" +
            "809801\n" +
            "809802\n" +
            "809803\n" +
            "809324\n" +
            "809326\n" +
            "809838\n" +
            "809839\n" +
            "809837\n" +
            "809327\n" +
            "809823\n" +
            "809836\n" +
            "809840\n" +
            "809804\n" +
            "809805\n" +
            "809806\n" +
            "809807\n" +
            "809808\n" +
            "809809\n" +
            "809600\n" +
            "809601\n" +
            "809403\n" +
            "809500\n" +
            "809517\n" +
            "809520\n" +
            "809521\n" +
            "809522\n" +
            "809701\n" +
            "809702\n" +
            "809703\n" +
            "809704\n" +
            "809705\n" +
            "809706\n" +
            "809707\n" +
            "809708\n" +
            "809710\n" +
            "809711\n" +
            "809750\n" +
            "809751\n" +
            "809752\n" +
            "809753\n" +
            "809754\n" +
            "809755\n" +
            "809756\n" +
            "809757\n" +
            "809758\n" +
            "809306\n" +
            "\"80930\n" +
            "\"80937\n" +
            "809311\n" +
            "809300\n" +
            "809316\n" +
            "809317\n" +
            "809318\n" +
            "809319\n" +
            "809320\n" +
            "809321\n" +
            "809322\n" +
            "809331\n" +
            "809332\n" +
            "809333\n" +
            "809334\n" +
            "809325\n" +
            "809335\n" +
            "809336\n" +
            "809337\n" +
            "809338\n" +
            "809339\n" +
            "809344\n" +
            "809345\n" +
            "809346\n" +
            "809348\n" +
            "809349\n" +
            "809350\n" +
            "809351\n" +
            "809352\n" +
            "809353\n" +
            "809356\n" +
            "809357\n" +
            "809358\n" +
            "809359\n" +
            "809360\n" +
            "809361\n" +
            "809362\n" +
            "809363\n" +
            "809364\n" +
            "809365\n" +
            "809366\n" +
            "809367\n" +
            "809368\n" +
            "809369\n" +
            "809812\n" +
            "809813\n" +
            "809814\n" +
            "809815\n" +
            "809816\n" +
            "809817\n" +
            "809818\n" +
            "809819\n" +
            "809820\n" +
            "809821\n" +
            "809822\n" +
            "809371\n" +
            "809372\n" +
            "809373\n" +
            "809374\n" +
            "809375\n" +
            "809824\n" +
            "809825\n" +
            "809826\n" +
            "809827\n" +
            "809828\n" +
            "809829\n" +
            "809830\n" +
            "809831\n" +
            "809832\n" +
            "809833\n" +
            "809834\n" +
            "809835\n" +
            "809841\n" +
            "809842\n" +
            "809843\n" +
            "809844\n" +
            "809845\n" +
            "809314\n" +
            "809315\n" +
            "809323\n" +
            "809340\n" +
            "809341\n" +
            "809342\n" +
            "809343\n";

    static Set<String> result;
    static Set<String> result2;

    public static void main(String[] args) throws Exception {



        HashSet<String> bopfunction = new HashSet<>();

        for (String s : function.split("\n")) {
            bopfunction.add(s.split("\t")[1]);
        }

        HashSet<String> f = new HashSet<>();
        for (String s : function2.split("\n")) {
            f.add(s);
        }
//        System.out.println(bopfunction);
//        System.out.println(f);

        result = new HashSet<String>();
        result.addAll(f);
        result.retainAll(bopfunction);

        System.out.println(result);
        System.out.println(result.size());

        result2 = new HashSet<String>();
        result2.addAll(bopfunction);
        result2.removeAll(f);
        System.out.println(result2);

        String rootPath = "D:\\bop\\source\\bop-ext";
        BufferedWriter bw = new BufferedWriter(new OutputStreamWriter(new FileOutputStream("./function1.txt")));
        BufferedWriter qbw = new BufferedWriter(new OutputStreamWriter(new FileOutputStream("./function2.txt")));
        BufferedWriter cbw = new BufferedWriter(new OutputStreamWriter(new FileOutputStream("./function3.txt")));
        getAllFunction(rootPath, bw, qbw, cbw);

                qbw.close();
        bw.close();
        cbw.close();
    }

    private static void getAllFunction(String path, BufferedWriter bw, BufferedWriter qbw, BufferedWriter cbw) throws Exception {
        File f = new File(path);
        if (f.isDirectory()) {
            File[] files = f.listFiles();
            for (File file : files) {
                getAllFunction(file.getAbsolutePath(), bw, qbw, cbw);
            }
        } else {
            if (f.getName().contains(".java")) {
                try (BufferedReader r = new BufferedReader(new InputStreamReader(new FileInputStream(f)))) {
                    String line = null;
                    while ((line = r.readLine()) != null) {
                        if (line.contains("@Service(functionId = \"809")) {
                            if (line.trim().startsWith("//")) {
                                continue;
                            }
                            if (line.indexOf(",") > 0) {
                                String substring = line.substring(line.indexOf("8"), line.indexOf(",") - 1);
                                if (result.contains(substring)) {
                                    if (line.contains("查询")) {
                                        qbw.write(line.substring(line.indexOf('(') + 1, line.indexOf(')') - 1));
                                        qbw.newLine();
                                    } else if (line.contains("检查")) {
                                        cbw.write(line.substring(line.indexOf('(') + 1, line.indexOf(')') - 1));
                                        cbw.newLine();
                                    } else {
                                        bw.write(line.substring(line.indexOf('(') + 1, line.indexOf(')') - 1));
                                        bw.newLine();
                                    }
                                }
                            }



                        }
                    }
                }
            }
        }
    }


}
